Return whether its cable tray/conduit type is with fitting
  Namespace:   Autodesk.Revit.DB.Electrical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool IsWithFitting()
  Visual Basic
Public Function IsWithFitting As Boolean
  Visual C++
public:
bool IsWithFitting()
 Return Value
 return true if its type is with fitting type.
 See Also
  CableTrayConduitBase Class
  Autodesk.Revit.DB.Electrical Namespace